In [2]:
import pandas as pd;

In [4]:
pd.DataFrame();

In [5]:
df1 = pd.DataFrame();

In [6]:
df1

Empty DataFrame
Columns: []
Index: []

In [7]:
type(df1)

pandas.core.frame.DataFrame

# Dicionários

In [10]:
dict1 = {
    'identificação': [1, 2, 3, 4, 5],
    'nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane'] }

In [11]:
dict1

{'identificação': [1, 2, 3, 4, 5],
 'nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane']}

In [13]:
df2 = pd.DataFrame(dict1)

In [14]:
df2

   identificação     nome
0              1     Caio
1              2  Rodrigo
2              3   Rafael
3              4  Mariane
4              5  Nathane

In [18]:
df3 = pd.DataFrame(data = dict1, index = [1, 2, 3, 4, 5])

In [19]:
df3

   identificação     nome
1              1     Caio
2              2  Rodrigo
3              3   Rafael
4              4  Mariane
5              5  Nathane

In [20]:
serie1 = pd.Series([1, 2, 3])

In [21]:
serie1

0    1
1    2
2    3
dtype: int64

In [32]:
serie2 = pd.Series(['a', 'b', 'c'])
serie2

0    a
1    b
2    c
dtype: object

In [33]:
df4 = pd.DataFrame({'coluna1': serie2, 'coluna2': serie1});
df4

  coluna1  coluna2
0       a        1
1       b        2
2       c        3

# Arrays

In [34]:
array1 = [
    ['1' , '2', '3'],
    ['São Paulo', 'Rio de Janeiro', 'Campinas'],
    ['SP', 'RJ', 'SP']
]

In [35]:
array1

[['1', '2', '3'],
 ['São Paulo', 'Rio de Janeiro', 'Campinas'],
 ['SP', 'RJ', 'SP']]

In [36]:
import numpy as np;

In [38]:
array_with_np = np.array(array1);

In [39]:
array_with_np

array([['1', '2', '3'],
       ['São Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [40]:
array_with.np.transpose()

NameError: name 'array_with' is not defined

In [41]:
array_with_np.transpose()

array([['1', 'São Paulo', 'SP'],
       ['2', 'Rio de Janeiro', 'RJ'],
       ['3', 'Campinas', 'SP']], dtype='<U14')

In [1]:
df5 = pd.DataFrame(data=array_with_np.transpose(), index=['linha1', 'linha2', 'linh3'], columns=['idenficacao', 'cidade'])

NameError: name 'pd' is not defined